#include <iostream>

using namespace std;

int main()
{
	cout << 731 << " " << 38144 << endl <<
		    2750 << " " << 36126 << endl <<
		    4769 << " " << 34108 << endl <<
		    6788 << " " << 32090 << endl <<
		    8807 << " " << 30072 << endl <<
		    10826 << " " << 28054 << endl <<
		    12845 << " " << 26036 << endl <<
		    14864 << " " << 24018 << endl <<
		    16883 << " " << 22000 << endl <<
		    18902 << " " << 19982 << endl <<
		    20921 << " " << 17964 << endl <<
		    22940 << " " << 15946 << endl <<
		    24959 << " " << 13928 << endl <<
		    26978 << " " << 11910 << endl <<
		    28997 << " " << 9892 << endl <<
		    31016 << " " << 7874 << endl <<
		    33035 << " " << 5856 << endl <<
		    35054 << " " << 3838 << endl <<
		    37073 << " " << 1820;
	return 0;
}

//Программа эффективна, потому что выполняется всего одна операция - вывод корней уравнения, которые заранее были посчитаны в другой программе.