/*Следующие 5 задач будут объединены одной структурой: struct Date{ int year; int month; int day; }; В этих задачах даты считаются по Грегорианскому календарю. 
 
21) Для структуры Date напишите метод, выписывающий наименование дня недели по дате. 
 
22) Для структуры Date напишите метод, определяющий, сколько дней осталось до Нового Года. 
 
23) Для структуры Date напишите оператор минус возвращающий, количество дней прошедших между датами. 
 
24) Для структуры Date напишите оператор плюс, принимающий целое число дней и возвращающий дату, отстоящую на это количество дней. 
 
25) Для структуры Date напишите метод, находящий следующую дату-палиндром.*/

#include <iostream>

using namespace std;

struct Date
{
	int Year;
	int Month;
	int Day;


};

int main()
{

}